


PCE WG                                                       Quan. Xiong
Internet-Draft                                               Fangwei. Hu
Intended status: Standards Track                               Ran. Chen
Expires: June 8, 2017                                    ZTE Corporation
                                                        December 5, 2016


                   stateful pce bandwidth scheduling
        draft-xiong-pce-stateful-pce-bandwidth-scheduling-01.txt

Abstract

   The Path Computation Element Communication Protocol (PCEP) provides
   mechanisms for Path Computation Elements (PCEs) to perform path
   computations in response to Path Computation Clients (PCCs) requests.
   The stateful PCE extensions allow stateful control of Multi-Protocol
   Label Switching (MPLS) Traffic Engineering Label Switched Paths (TE
   LSPs) using PCEP.

   This document proposes a set of extensions for the stateful PCE, so
   as to enable bandwidth scheduling for LSP and adjust the bandwidth
   based on the customers' scheduled bandwidth requirement of a traffic
   service in a centralized network environment.  A bandwidth scheduled
   LSP can be adjusted to the new bandwidth at its starting time and
   adjusted back to the original bandwidth at its ending time.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on June 8, 2017.

Copyright Notice

   Copyright (c) 2016 IETF Trust and the persons identified as the
   document authors.  All rights reserved.




Xiong, et al.             Expires June 8, 2017                  [Page 1]

Internet-Draft            bandwidth scheduling             December 2016


   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2
   2.  Requirements Language . . . . . . . . . . . . . . . . . . . .   3
     2.1.  Terminology . . . . . . . . . . . . . . . . . . . . . . .   3
   3.  Bandwidth scheduling Overview . . . . . . . . . . . . . . . .   4
   4.  New function to support Bandwidth scheduling  . . . . . . . .   4
   5.  Extensions to the PCEP  . . . . . . . . . . . . . . . . . . .   5
     5.1.  Support of Bandwidth Scheduling Capability  . . . . . . .   5
       5.1.1.  Stateful PCE Capability TLV . . . . . . . . . . . . .   5
     5.2.  Scheduled Bandwidth adjustment  . . . . . . . . . . . . .   5
       5.2.1.  SCHED-BW-ADJUST-ATTRIBUTE TLV . . . . . . . . . . . .   6
       5.2.2.  The PCReq Message . . . . . . . . . . . . . . . . . .   8
       5.2.3.  The PCRpt Message . . . . . . . . . . . . . . . . . .   8
       5.2.4.  The PCUpd Message . . . . . . . . . . . . . . . . . .   8
   6.  Security Considerations . . . . . . . . . . . . . . . . . . .   9
   7.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   9
     7.1.  PCEP TLV Type Indicators  . . . . . . . . . . . . . . . .   9
     7.2.  SCHED-BW-ADJUST-CAPABLITY . . . . . . . . . . . . . . . .   9
   8.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .   9
   9.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   9
     9.1.  Informative References  . . . . . . . . . . . . . . . . .  10
     9.2.  Normative References  . . . . . . . . . . . . . . . . . .  10
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  10

1.  Introduction

   [RFC5440] describes the Path Computation Element Protocol (PCEP)
   which is used between a Path Computation Element (PCE) and a Path
   Computation Client (PCC) (or other PCE) to enable computation of
   Multi-protocol Label Switching (MPLS) for Traffic Engineering Label
   Switched Path (TE LSP).[I-D.ietf-pce-stateful-pce] specifies a set of
   extensions to PCEP to enable stateful control of MPLS TE LSPs.
   [I-D.ietf-pce-pce-initiated-lsp] describes the setup, maintenance and
   teardown of PCE-initiated LSPs for the stateful PCE model.

   In some scenarios, an LSP established with certain bandwidth may
   require to adjust its bandwidth to a particular value during a period



Xiong, et al.             Expires June 8, 2017                  [Page 2]

Internet-Draft            bandwidth scheduling             December 2016


   of time so as to satisfy the network traffic requirement.
   Traditionally, this can be supported by network management system
   (NMS) operation through path pre-configuration on the agreed time or
   accomplished through GMPLS protocol extensions by carrying the
   related request information across the network.  However, as the
   [I-D.ietf-pce-stateful-pce-app] discussed, this does not provide
   efficient network usage and will increase the complexity.

   [I-D.ietf-pce-stateful-pce-app] describes the requirement of
   bandwidth scheduling, so as to provide more efficient network
   resource usage for traffic engineering, and allows network operators
   to reserve resources in advance according to the agreements with
   their customers, and allow them to transmit data with specified
   starting time and duration.

   This document proposes bandwidth scheduling and provides scheduled
   bandwidth adjustment for LSP, so as to adjust the bandwidth to the
   new value at the starting time and return to the original bandwidth
   after the duration time.  With the scheduled reservation of TE
   resources, it allows network operators to require scheduled bandwidth
   adjustment and resource according to the agreements with their
   customers, and allow them to transmit data with scheduled bandwidth
   such as specified starting time and ending time.

2.  Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [RFC2119].

2.1.  Terminology

   The terminology is defined as [RFC5440] and
   [I-D.ietf-pce-stateful-pce-app] except the following which proposed
   in this document:

   Scheduled Bandwidth (Bandwidth Scheduling): a LSP with the scheduling
   bandwidth, that carries the demand bandwidth at a starting time and
   adjust to its original bandwidth at an ending time.

   Starting time: This value indicates the time when the scheduled
   bandwidth is adjusted to the new value.

   Ending time: The value indicates the time when the scheduled
   bandwidth is adjusted to the original value.






Xiong, et al.             Expires June 8, 2017                  [Page 3]

Internet-Draft            bandwidth scheduling             December 2016


3.  Bandwidth scheduling Overview

   The bandwidth scheduling allows PCEs and PCCs to provide scheduled
   bandwidth adjustment for customers' traffic services at its
   particular usage time, so as to improve the network control of
   traffic flowing.

   For a passive stateful PCE, it can support this application with
   better efficiency and PCCs need to send request to PCEs for bandwidth
   scheduling including its scheduling parameters.

   For an active stateful PCE, the PCE can trigger the scheduled
   requests in a centralized manner, as specified in
   [I-D.ietf-pce-pce-initiated-lsp], by notifying the PCCs to modify the
   paths and adjust the bandwidth.  And the scheduled bandwidth
   information is then configured by NMS or customers.

   Then the stateful PCE must reserve the network resource for the
   traffic and computes a path for the scheduled bandwidth.  This
   requires the PCE to maintain the LSPs, scheduled bandwidth parameters
   and their associated resource usage, as well as the ability of head-
   ends to trigger signaling for LSP adjustment at the correct time
   which uses the make-before-break signaling method so that there is no
   interruption to the traffic flow.

   In both cases, this requires resource reservation and time
   synchronization between PCEs and PCCs which is to be discussed in the
   future.

4.  New function to support Bandwidth scheduling

   Several new functions are required in PCEP to support stateful PCEs.
   A function can be initiated either from a PCC towards a PCE (C-E) or
   from a PCE towards a PCC (E-C).

   The new functions are:

   Capability advertisement (E-C,C-E): both the PCC and the PCE must
   announce during PCEP session establishment that they support PCEP
   Stateful PCE bandwidth scheduling extensions defined in this
   document.

   LSP Path Computation Request (C-E): for PCC-Initiated bandwidth
   scheduling, a PCC can send a request within a path computation
   request message to PCE with the extensions defined in this document.

   LSP State Report (C-E): for PCC-Initiated bandwidth scheduling, LSP
   creation and bandwidth scheduling request can be separated and the



Xiong, et al.             Expires June 8, 2017                  [Page 4]

Internet-Draft            bandwidth scheduling             December 2016


   PCC can send a report message including its bandwidth scheduling
   information to PCE with the extensions defined in this document.

   LSP Update Request (E-C): when the time expires, the PCE SHALL send a
   update message with the path result to adjust the bandwidth of the
   LSP.

5.  Extensions to the PCEP

5.1.  Support of Bandwidth Scheduling Capability

5.1.1.  Stateful PCE Capability TLV

   The STATEFUL-PCE-CAPABILITY TLV MUST support bandwidth scheduling in
   Open Object which contained in Open message, as defined in
   [I-D.ietf-pce-stateful-pce] and updated in [I-D.ietf-pce-pce-initiate
   d-lsp],[I-D.ietf-pce-stateful-sync-optimizations].  In this document,
   a new flag bit A (SCHED-BW-ADJUST-CAPABLITY) is defined for the
   STATEFUL- PCE-CAPABILITY TLV to indicate the capability of bandwidth
   scheduling.

   The format of STATEFUL-PCE-CAPABILITY TLV is shown as follow.  I, S
   and U is defined in other documents which mentioned above.

        0                   1                   2                   3
        0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |          Type=[TBD]           |           Length=4            |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                         Flags                         |A|I|S|U|
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
                Figure 1 SCHED-BW-ADJUST-CAPABILITY Flags format

   A (SCHED-BW-ADJUST-CAPABLITY - 1 bit): If set to 1 by a PCC, the A
   Flag indicates that the PCC allows bandwidth scheduling; if set to 1
   by a PCE, the A Flag indicates that the PCE is capable of bandwidth
   scheduling.  The A bit MUST be set by both PECP peers in order to
   support bandwidth scheduling for path computation.

5.2.  Scheduled Bandwidth adjustment

   In order to realize bandwidth scheduling in a centralized network
   environment, it has to separate the process into two steps.  The
   first step is to send request to PCEs, so as to configure the
   scheduled parameters and reserve the resource over the network.  The
   second step is to trigger the adjustment to PCCs to re-signal the LSP
   with the scheduled bandwidth over the network at its starting time
   and ending time.



Xiong, et al.             Expires June 8, 2017                  [Page 5]

Internet-Draft            bandwidth scheduling             December 2016


   To realize PCC-Initiated bandwidth scheduling, the PCC MAY send the
   bandwidth scheduling request to PCE.  Alternatively, the PCE-
   Initiated bandwidth scheduling request is triggered by NMS or users.

   If the bandwidth scheduling request is accepted, the stateful PCE MAY
   compute a path based on the scheduled bandwidth and adjust the
   bandwidth of that LSP at its scheduled time by send a PCUpd message
   with path computation result and SCHED-BW-ADJUST-ATTRIBUTE TLV.

   When the ending time expires, the PCE shall send a PCUpd message with
   the original path and bandwidth of the LSP to adjust back.

   The PCC which received the message SHOULD minimize the traffic
   interruption, and MAY use the make-before-break procedures in order
   to achieve this bandwidth adjustment.

5.2.1.  SCHED-BW-ADJUST-ATTRIBUTE TLV

   The LSP object is defined in [I-D.ietf-pce-stateful-pce].  This
   document adds an optional SCHED-BW-ADJUST-ATTRIBUTE TLV.

   The SCHED-BW-ADJUST-ATTRIBUTE TLV in the LSP object indicates that
   this LSP is requesting scheduled bandwidth parameters.  The LSP
   Object with that TLV carried in the PCReq message, the PCRpt message
   and the PCUpd message MUST be presented for each LSP which requires
   scheduled bandwidth.

   The SCHED-BW-ADJUST-ATTRIBUTE TLV can be included as an optional TLV
   within the LSP object for Bandwidth scheduling for the requesting
   traffic service.

   This TLV SHOULD be included only if both PCEP peers have set the A
   (SCHED-BW-ADJUST-CAPABILITY bit) in STATEFUL-PCE-CAPABILITY TLV
   carried in open message.

   The format of the SCHED-BW-ADJUST-ATTRIBUTE TLV is shown in the
   following figure:














Xiong, et al.             Expires June 8, 2017                  [Page 6]

Internet-Draft            bandwidth scheduling             December 2016


        0                   1                   2                   3
        0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |              Type             |            Length             |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                                                               |
       |                          Starting Time                        |
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                                                               |
       |                          Ending Time                          |
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                          Bandwidth                            |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
                Figure 2 SCHED-BW-ADJUST-ATTRIBUTE TLV format



   The time format including starting time and ending time is YYYY-MM-
   DD-HH-MM and it indicates year, month, date, hour and minute
   respectively as follows.

        0                   1                   2                   3
        0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                              Year                             |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |             Month             |              Date             |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |             Hour              |              Minute           |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
                         Figure 3 Time TLV format


   o  The type of the TLV is [TBD].  The fields in the format are:

   o  Starting Time (32 * 3 bits): This value in minutes, indicates when
      the bandwidth of LSP is adjusted to the scheduled bandwidth.

   o  Ending Time (32 * 3 bits): The value in minutes, indicates when
      the scheduled bandwidth is adjusted to the original value.

   o  Bandwidth (32 bits): The value indicates the scheduled bandwidth
      which the LSP is adjusted during the period of time and its detail
      format see [RFC5440].





Xiong, et al.             Expires June 8, 2017                  [Page 7]

Internet-Draft            bandwidth scheduling             December 2016


   Note, that the values of starting time and ending time is from the
   perspective of the PCEP peer that is sending the message, also note
   the unit of time is minutes, and thus the time spent on transmission
   on wire can be easily ignored.

5.2.2.  The PCReq Message

   For PCC-Initiated bandwidth scheduling, a PCC can choose to send
   request within a path computation request (PCReq) message or not.

   If a PCC send a PCReq message with SCHED-BW-ADJUST-ATTRIBUTE TLV in
   LSP object, the PCE MUST compute a path for that LSP and check the
   scheduled request, reserve the resource and store the scheduled
   information.  If that is satisfied, the PCE SHALL sends a PCRep
   message with the SCHED-LSP-ATTRIBUTE TLV, as well as the LSP Object
   and path result back to the requesting PCC.

   If failures happen or no resource available for the current path, the
   requesting PCE SHALL return a PCRep message with NO PATH back to the
   PCC.

   If failures happen or no resource reservation for scheduled bandwidth
   request, the requesting PCE SHALL return a PCErr message with PCEP-
   ERROR object back to the PCC.

5.2.3.  The PCRpt Message

   For PCC-Initiated, creation and bandwidth scheduling request can be
   separated.  If a LSP is already set up, the PCC can choose report
   (PCRpt) message including its bandwidth scheduling information and
   delegation to a stateful PCE.

   Upon receiving the delegation via PCRpt message, the stateful PCE
   computes the path for the LSP per its starting time and ending time
   based on bandwidth scheduling parameters.

   If failures happen or no resource reservation for scheduled bandwidth
   request, the requesting PCE SHALL return a PCErr message with PCEP-
   ERROR object back to the PCC.

5.2.4.  The PCUpd Message

   When the starting time or ending time expires, if the scheduled
   bandwidth request from PCCs or NMS can be satisfied and an available
   path is computed, the stateful PCE SHALL send a PCUpd Message
   including path computation result and the SCHED-BW-ADJUST-ATTRIBUTE
   TLV in the LSP Object body to the PCC, so as to adjust the bandwidth
   of the LSP.



Xiong, et al.             Expires June 8, 2017                  [Page 8]

Internet-Draft            bandwidth scheduling             December 2016


   Moreover, the stateful PCE can update the scheduled bandwidth
   parameters at any time based on bandwidth requirement from customer
   using the PCUpd message including SCHED-BW-ADJUST-ATTRIBUTE TLV in
   the LSP Object body.

6.  Security Considerations

   TBD

7.  IANA Considerations

7.1.  PCEP TLV Type Indicators

   This document defines the following new PCEP TLV; IANA is requested
   to make the following allocations from this registry.

        +--------+----------------------------+------------------+
        | Value  |          Meaning           |    Reference     |
        +--------+----------------------------+------------------+
        |  TBD   | SCHED-BW-ADJUST-ATTRIBUTE  | [this document]  |
        +--------+----------------------------+------------------+

                                  Table 1

7.2.  SCHED-BW-ADJUST-CAPABLITY

   This document requests that a registry is created to manage the Flags
   field in the STATEFUL-PCE-CAPABILITY TLV in the OPEN object.  New
   values are to be assigned by Standards Action [RFC5226].

     +------+------------------------------------+------------------+
     | Bit  |            Description             |    Reference     |
     +------+------------------------------------+------------------+
     | TBD  | SCHED-BW-ADJUST-CAPABILITY (A-bit) | [this document]  |
     +------+------------------------------------+------------------+

                                  Table 2

8.  Acknowledgements

   TBD.

9.  References








Xiong, et al.             Expires June 8, 2017                  [Page 9]

Internet-Draft            bandwidth scheduling             December 2016


9.1.  Informative References

   [I-D.ietf-pce-stateful-pce-app]
              Zhang, X. and I. Minei, "Applicability of a Stateful Path
              Computation Element (PCE)", draft-ietf-pce-stateful-pce-
              app-08 (work in progress), October 2016.

9.2.  Normative References

   [I-D.ietf-pce-pce-initiated-lsp]
              Crabbe, E., Minei, I., Sivabalan, S., and R. Varga, "PCEP
              Extensions for PCE-initiated LSP Setup in a Stateful PCE
              Model", draft-ietf-pce-pce-initiated-lsp-07 (work in
              progress), July 2016.

   [I-D.ietf-pce-stateful-pce]
              Crabbe, E., Minei, I., Medved, J., and R. Varga, "PCEP
              Extensions for Stateful PCE", draft-ietf-pce-stateful-
              pce-18 (work in progress), December 2016.

   [I-D.ietf-pce-stateful-sync-optimizations]
              Crabbe, E., Minei, I., Medved, J., Varga, R., Zhang, X.,
              and D. Dhody, "Optimizations of Label Switched Path State
              Synchronization Procedures for a Stateful PCE", draft-
              ietf-pce-stateful-sync-optimizations-06 (work in
              progress), October 2016.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <http://www.rfc-editor.org/info/rfc2119>.

   [RFC5440]  Vasseur, JP., Ed. and JL. Le Roux, Ed., "Path Computation
              Element (PCE) Communication Protocol (PCEP)", RFC 5440,
              DOI 10.17487/RFC5440, March 2009,
              <http://www.rfc-editor.org/info/rfc5440>.

Authors' Addresses

   Quan Xiong
   ZTE Corporation
   No.6 Huashi Park Rd
   Wuhan, Hubei  430223
   China

   Phone: +86 27 83531060
   Email: xiong.quan@zte.com.cn




Xiong, et al.             Expires June 8, 2017                 [Page 10]

Internet-Draft            bandwidth scheduling             December 2016


   Fangwei Hu
   ZTE Corporation
   No.889 Bibo Rd
   Shanghai  201203
   China

   Phone: +86 21 68896273
   Email: hu.fangwei@zte.com.cn


   Ran Chen
   ZTE Corporation
   No.50 Software Avenue,Yuhuatai District
   Nanjing, Jiangsu Province  210012
   China

   Phone: +86 025 88014636
   Email: chen.ran@zte.com.cn

































Xiong, et al.             Expires June 8, 2017                 [Page 11]

